test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices        
(
    ( 0   -300   0)
    ( 1500   -300   0)
    ( 1500   300   0)
    ( 0   300   0)
    ( 0   -300   600)
    ( 1500   -300   600)
    ( 1500   300   600)
    ( 0   300   600)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (300 80 120) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    zMin
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    zMax
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    xMin
    { 
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    xMax
    { 
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    yMax
    { 
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    yMin
    { 
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
