test/constant/turbineProperties/NREL5MW_Simple
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/turbineProperties";
    object      NREL5MW_Simple;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Basic turbine geometry
TipRad          63.0;       // Rotor tip radius [m]
HubRad          1.5;        // Hub radius [m]
TowerHt         90.0;       // Tower height [m]
Twr2Shft        2.4;        // Tower top to shaft centerline [m]
OverHang        5.0;        // Overhang distance [m]
UndSling        0.0;        // Undersling [m]
ShftTilt        0;        // Shaft tilt angle [deg]
PreCone         (0 0 0);  // Blade precone angles [deg]

// Power/Ct performance curves (industry-standard format)
// Format: (windSpeed[m/s]  Power[kW]  Ct)
PowerCtData
(
    (0.0  0          0)
    (2.0  0          0)
    (2.5  0          0)
    (3.0  36.7221558 0.990000000)
    (3.5  94.6567812 0.990000000)
    (4.0  170.596392 0.973730360)
    (4.5  267.749335 0.928261620)
    (5.0  387.646814 0.892105430)
    (5.5  533.961715 0.861009050)
    (6.0  707.406240 0.835423000)
    (6.5  909.996578 0.812376730)
    (7.0  1142.71978 0.792257890)
    (7.5  1407.49942 0.775847690)
    (8.0  1707.12722 0.762922800)
    (8.5  2047.33558 0.761560730)
    (9.0  2430.57781 0.762619840)
    (9.5  2858.30812 0.761697230)
    (10.0 3329.10063 0.752320270)
    (10.5 3842.97559 0.740268510)
    (11.0 4403.86141 0.729871750)
    (11.5 4999.99351 0.707016470)
    (12.0 4999.99850 0.540545320)
    (12.5 4999.99785 0.455094590)
    (13.0 5000.00305 0.393433810)
    (13.5 5000.00211 0.342507850)
    (14.0 4999.99728 0.304872420)
    (14.5 5000.00224 0.271649790)
    (15.0 5000.00036 0.243619640)
    (15.5 5000.00907 0.219738310)
    (16.0 4999.98726 0.199181510)
    (16.5 5000.00735 0.181318680)
    (17.0 5000.00688 0.165376790)
    (17.5 4999.99499 0.151037270)
    (18.0 4999.97706 0.139986360)
    (18.5 4999.98370 0.128903700)
    (19.0 4999.99132 0.119704130)
    (19.5 5000.02402 0.110871130)
    (20.0 5000.01659 0.103399010)
    (20.5 5000.02571 0.0961788800)
    (21.0 4999.94489 0.0900992600)
    (21.5 5000.03532 0.0839507800)
    (22.0 4999.96796 0.0791188000)
    (22.5 5000.01325 0.0744835600)
    (23.0 5000.06320 0.0705073100)
    (23.5 5000.06898 0.0668411900)
    (24.0 4999.93252 0.0634551800)
    (24.5 5000.01104 0.0603226700)
    (25.0 5000.01277 0.0574199900)
    (25.0 4717.24338 0.0547260900)
    (25.0 0.0        0)
    (50.0 0.0        0)
);

// ************************************************************************* //
