test/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (6.0 0 0);

boundaryField
{
    xMin
    {
        type            fixedValue;
        value           $internalField;
    }
    
    xMax
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }


    yMin
    {
        type            slip;
    }

    yMax
    {
        type            slip;
    }

    zMin
    {
        type            slip;
    }

    zMax
    {
        type            slip;
    }
}


// ************************************************************************* //
