test/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.001293; // Cmu^0.75 * k^1.5 / L; k=0.54(TI=10%), L=0.4*D=50.4m(NREL5MW)

boundaryField
{
    xMin
    {
        type            fixedValue;
        value           $internalField;
    }

    xMax
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    zMin
    {
        type            slip;
    }

    zMax
    {
        type            slip;
    }

    "(yMin|yMax)"
    {
        type            slip;
    }
}

// ************************************************************************* //
