test/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xMin
    {
        type            calculated;
        value           $internalField;
    }

    xMax
    {
        type            calculated;
        value           uniform 0;
    }

    zMin
    {
        type            calculated;
        value           uniform 0;
    }


    zMax
    {
        type            calculated;
        value           uniform 0;
    }

    "(yMin|yMax)"
    {
        type            calculated;
        value           uniform 0;
    }
}

// ************************************************************************* //
